package leetcode.editor.cn;
//请你判断一个 9x9 的数独是否有效。只需要 根据以下规则 ，验证已经填入的数字是否有效即可。
// 数字 1-9 在每一行只能出现一次。 
// 数字 1-9 在每一列只能出现一次。 
// 数字 1-9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。（请参考示例图）
// 数独部分空格内已填入了数字，空白格用 '.' 表示。
// 注意：
// 一个有效的数独（部分已被填充）不一定是可解的。 
// 只需要根据以上规则，验证已经填入的数字是否有效即可。
// 示例 1：
//输入：board = 
//[['5','3','.','.','7','.','.','.','.']
//,['6','.','.','1','9','5','.','.','.']
//,['.','9','8','.','.','.','.','6','.']
//,['8','.','.','.','6','.','.','.','3']
//,['4','.','.','8','.','3','.','.','1']
//,['7','.','.','.','2','.','.','.','6']
//,['.','6','.','.','.','.','2','8','.']
//,['.','.','.','4','1','9','.','.','5']
//,['.','.','.','.','8','.','.','7','9']]
//输出：true
// 示例 2：
//输入：board = 
//[['8','3','.','.','7','.','.','.','.']
//,['6','.','.','1','9','5','.','.','.']
//,['.','9','8','.','.','.','.','6','.']
//,['8','.','.','.','6','.','.','.','3']
//,['4','.','.','8','.','3','.','.','1']
//,['7','.','.','.','2','.','.','.','6']
//,['.','6','.','.','.','.','2','8','.']
//,['.','.','.','4','1','9','.','.','5']
//,['.','.','.','.','8','.','.','7','9']]
//输出：false
//解释：除了第一行的第一个数字从 5 改为 8 以外，空格内其他数字均与 示例1 相同。 但由于位于左上角的 3x3 宫内有两个 8 存在, 因此这个数独是无
//效的。
// 提示：
// board.length == 9 
// board[i].length == 9 
// board[i][j] 是一位数字或者 '.'
// Related Topics 数组 哈希表 矩阵 👍 611 👎 0

import java.util.Arrays;
import java.util.HashSet;
import java.util.Set;

//leetcode submit region begin(Prohibit modification and deletion)
class isValidSudokuSolution {
    public boolean isValidSudoku(char[][] board) {
        boolean isValid = true;
        int[] flag = new int[9];
        for (char[] row : board) {
            for (char c : row) {
                if (c != '.') {
                    if (flag[c - 49] == 1)
                        return false;
                    else
                        flag[c - 49] = 1;
                }
                else continue;
            }
            Arrays.fill(flag, 0);
        }

        for (int i = 0; i < board.length; i++) {
            for (int j = 0; j < board[0].length; j++) {
                if (board[j][i] != '.') {
                    if (flag[board[j][i] - 49] == 1)
                        return false;
                    else
                        flag[board[j][i] - 49] = 1;
                }
                else continue;
            }
            Arrays.fill(flag, 0);
        }

        for (int i = 0; i < board.length; i+=3)
            for (int j = 0; j < board[0].length; j+=3) {
                for (int ii = 0; ii < 3; ii++)
                    for (int jj = 0; jj < 3; jj++) {
                        if (board[i+ii][j+jj] != '.') {
                            if (flag[board[i+ii][j+jj] - 49] == 1)
                                return false;
                            else
                                flag[board[i+ii][j+jj] - 49] = 1;
                        }
                        else continue;
                    }
            }
        return isValid;
    }

    public static void main(String[] args) {
        isValidSudokuSolution solution = new isValidSudokuSolution();
        System.out.println(solution.isValidSudoku(new char[][]{
                {'5', '3', '.', '.', '7', '.', '.', '.', '.'},
                {'6', '.', '.', '1', '9', '5', '.', '.', '.'},
                {'.', '9', '8', '.', '.', '.', '.', '6', '.'},
                {'8', '.', '.', '.', '6', '.', '.', '.', '3'},
                {'4', '.', '.', '8', '.', '3', '.', '.', '1'},
                {'7', '.', '.', '.', '2', '.', '.', '.', '6'},
                {'.', '6', '.', '.', '.', '.', '2', '8', '.'},
                {'.', '.', '.', '4', '1', '9', '.', '.', '5'},
                {'.', '.', '.', '.', '8', '.', '.', '7', '9'}
        }));
    }
}
//leetcode submit region end(Prohibit modification and deletion)
